**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [3]:
import numpy as np
import pandas as pd

# data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], \
#         'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], \
#         'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], \
#         'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

# labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

# df = pd.DataFrame.from_dict(data)

**OR**

In [122]:
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], \
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], \
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], \
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

birds_df = pd.DataFrame(data, index = labels)

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [94]:
birds_df.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe.**

In [95]:
# Using slicing
birds_df[:2]

# OR

# Using head() method with the number of rows you would like to retrieve
# birds_df.head(2)

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [96]:
birds_df[['birds', 'age']]

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. Select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [97]:
# Using loc[] - method that takes only index labels and returns rows if the index label exists in the data frame.
# birds_df[['birds', 'age', 'visits']].loc[['c', 'd', 'h']]

# Using iloc[] -  used when the index label of a data frame is something other than numeric series.
birds_df[['birds', 'age', 'visits']].iloc[[2, 3, 7]]

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

**6. Select the rows where the number of visits is less than 4**

In [98]:
birds_df[birds_df['visits'] < 4]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**7. Select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [99]:
# birds_df.isnull() - detects the missing values and returns a boolean value accordingly.

birds_missing = birds_df[birds_df['age'].isnull()]
birds_missing[['birds', 'visits']]

        birds  visits
d  spoonbills       4
h      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [100]:
birds_df[(birds_df['birds'] == 'Cranes') & (birds_df['age'] < 4)]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [101]:
birds_df[birds_df['age'].between(2,4)]

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [102]:
birds_df[(birds_df['birds'] == 'Cranes') & (birds_df['visits'] > 0)].sum()

birds       CranesCranesCranesCranes
age                             10.5
visits                            12
priority                 yesyesnoyes
dtype: object

**11. Calculate the mean age for each different birds in dataframe.**

In [123]:
# Using groupby() helps in grouping birds by bird names.
group_birds = birds_df.groupby('birds')

# Using a for-loop to print the mean ages of different category of birds in the DataFrame
for bird, birds_df in group_birds:
    print(bird, birds_df['age'].mean())

Cranes 3.5
plovers 3.5
spoonbills 6.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [104]:
# Adding a new row with index 'k' to the 'birds' DataFrame
birds_df.loc['k'] = ['kingfisher', 7.0, 5, 'no']
# birds_df

# deleting the newly created row
birds_df = birds_df.drop('k')
birds_df

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [105]:
birds_df['birds'].value_counts()

spoonbills    4
Cranes        4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [106]:
# Sorting dataframe by 'age' first and then by 'visits'

sorted_df = birds_df.sort_values(['age', 'visits'], ascending = [False, True], axis = 0)
sorted_df

## The below commands sort the dataframe according to the individual column name in the desired order

# birds_df.sort_values(['age'], ascending = False)

# birds_df.sort_values(['visits'], ascending = True)

        birds  age  visits priority
i  spoonbills  8.0       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
j  spoonbills  4.0       2       no
b      Cranes  4.0       4      yes
a      Cranes  3.5       2      yes
f      Cranes  3.0       4       no
c     plovers  1.5       3       no
h      Cranes  NaN       2      yes
d  spoonbills  NaN       4      yes

**15. Replace the priority column values with 'yes' should be 1 and 'no' should be 0**

In [107]:
birds_df.replace(to_replace = ['yes', 'no'], value = [1, 0])

        birds  age  visits  priority
a      Cranes  3.5       2         1
b      Cranes  4.0       4         1
c     plovers  1.5       3         0
d  spoonbills  NaN       4         1
e  spoonbills  6.0       3         0
f      Cranes  3.0       4         0
g     plovers  5.5       2         0
h      Cranes  NaN       2         1
i  spoonbills  8.0       3         0
j  spoonbills  4.0       2         0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [108]:
birds_df.loc[birds_df.birds == 'Cranes', 'birds'] = 'trumpeters'
birds_df

        birds  age  visits priority
a  trumpeters  3.5       2      yes
b  trumpeters  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f  trumpeters  3.0       4       no
g     plovers  5.5       2       no
h  trumpeters  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no